# Taps
tap "bramstein/webfonttools"

# Core utilities
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "gnu-sed"
brew "zsh"
brew "wget"

# macOS tools
brew "grep"
brew "openssh"
brew "screen"
brew "php"
brew "gmp"

# Font tools
brew "woff2"

# Useful binaries
brew "ack"
brew "git"
brew "git-lfs"
brew "gs"
brew "imagemagick"
brew "lua"
brew "lynx"
brew "p7zip"
brew "pigz"
brew "pv"
brew "rename"
brew "rlwrap"
brew "ssh-copy-id"
brew "tree"
brew "vbindiff"
brew "zopfli"
brew "z"
brew "zplug"
brew "openjdk@21"

# Development tools
brew "deno"
brew "diffutils"
brew "ffmpeg"
brew "gh"
brew "eza"
brew "gifsicle"
brew "git-delta"
brew "jq"
brew "optipng"
brew "pkgconf"
brew "pnpm"
brew "ripgrep"
brew "yq"
brew "tmux"
brew "tmuxinator"
brew "graphicsmagick"
brew "cmatrix"

# Casks
cask "1password"
cask "1password-cli"
cask "google-chrome"
cask "google-chrome@canary"
cask "firefox"
cask "firefox@developer-edition"
cask "firefox@nightly"
cask "alfred"
cask "brave-browser"
cask "disk-inventory-x"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "ghostty"
cask "imageoptim"
cask "rectangle"
cask "vlc"
cask "docker"
cask "cursor"
cask "sourcetree"
cask "istat-menus"
cask "signal"
cask "discord"
cask "vlc"
cask "figma"
cask "imageoptim"
cask "sequel-ace"
cask "react-native-debugger"
cask "maccy"
cask "dbngin"
cask "appcleaner"
