andrejunges.handlebars
andys8.jest-snippets
angular.ng-template
antyos.openscad
axetroy.vscode-auto-schema
bierner.color-info
bierner.markdown-mermaid
bmewburn.vscode-intelephense-client
bradlc.vscode-tailwindcss
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
cweijan.dbclient-jdbc
cweijan.vscode-mysql-client2
danielsanmedium.dscodegpt
davidanson.vscode-markdownlint
dawhite.mustache
dbaeumer.vscode-eslint
digitalbrainstem.javascript-ejs-support
dsznajder.es7-react-js-snippets
duynvu.dbml-language
eamodio.gitlens
editorconfig.editorconfig
equimper.react-native-react-redux-snippets-for-es6-es7-version-standard
espressif.esp-idf-extension
expo.vscode-expo-tools
firefox-devtools.vscode-firefox-debug
github.copilot
github.copilot-chat
gitpod.gitpod-desktop
grapecity.gc-excelviewer
gruntfuggly.todo-tree
jaredly.reason-vscode
johnbillion.vscode-wordpress-hooks
jpoissonnier.vscode-styled-components
jprestidge.theme-material-theme
kleber-swf.unity-code-snippets
kumar-harsh.graphql-for-vscode
lkytal.coffeelinter
lottiefiles.vscode-lottie
mariomatheu.syntax-project-pbxproj
marus25.cortex-debug
matt-meyers.vscode-dbml
mcu-debug.debug-tracker-vscode
mcu-debug.memory-view
mcu-debug.peripheral-viewer
mcu-debug.rtos-views
mgmcdermott.vscode-language-babel
mikestead.dotenv
ml.nc-gcode
mrcrowl.hg
ms-azuretools.vscode-docker
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cpptools
ms-vscode.remote-explorer
ms-vscode.vscode-serial-monitor
msjsdiag.vscode-react-native
mtxr.sqltools
mtxr.sqltools-driver-sqlite
octref.vetur
okitavera.vscode-nunjucks-formatter
oouo-diogo-perdigao.docthis
orta.vscode-ios-common-files
petermekhaeil.vscode-tailwindcss-explorer
platformio.platformio-ide
plibither8.remove-comments
rangav.vscode-thunder-client
redhat.vscode-commons
redhat.vscode-yaml
ronnidc.nunjucks
shanoor.vscode-nginx
slevesque.vscode-zipexplorer
timonvs.reactsnippetsstandard
tobermory.es6-string-html
tobiah.unity-tools
tomoki1207.pdf
vincaslt.highlight-matching-tag
vscjava.vscode-gradle
vue.volar
wallabyjs.console-ninja
ziishaned.snippetmaker
